using UnityEngine;

namespace Assets.Game.Code.TheoryPractice
{
    public class YellowCrystal : MonoBehaviour
    {
        // Сделать желтый кристалл.
        // Дать ссылки в скрипте кристала на 4 точки в случайных местах на сцене (желательно ближе к самому кристаллу).
        // Сделать детектор соприкасаний с кристалом (триггер) с проверкой что его коснулся игрок.
        // Удалять кристалл после соприкосновения с игроком.
        // Спавнить в указанных 4 точках по красному кристаллу.
    }
}